Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/can.h
#define CAN_XIDAM_EIDM_Pos                    _UINT32_(0)                                          /* (CAN_XIDAM) Extended ID Mask Position */
#define CAN_XIDAM_EIDM_Msk                    (_UINT32_(0x1FFFFFFF) << CAN_XIDAM_EIDM_Pos)         /* (CAN_XIDAM) Extended ID Mask Mask */
#define CAN_XIDAM_EIDM(value)                 (CAN_XIDAM_EIDM_Msk & (_UINT32_(value) << CAN_XIDAM_EIDM_Pos)) /* Assigment of value for EIDM in the CAN_XIDAM register */
#define CAN_XIDAM_Msk                         _UINT32_(0x1FFFFFFF)                                 /* (CAN_XIDAM) Register Mask  */


/* -------- CAN_XIDFC : (CAN Offset: 0x88) (R/W 32) Extended ID Filter Configuration -------- */
#define CAN_XIDFC_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAN_XIDFC) Extended ID Filter Configuration  Reset Value */

#define CAN_XIDFC_FLESA_Pos                   _UINT32_(0)                                          /* (CAN_XIDFC) Filter List Extended Start Address Position */
#define CAN_XIDFC_FLESA_Msk                   (_UINT32_(0xFFFF) << CAN_XIDFC_FLESA_Pos)            /* (CAN_XIDFC) Filter List Extended Start Address Mask */
#define CAN_XIDFC_FLESA(value)                (CAN_XIDFC_FLESA_Msk & (_UINT32_(value) << CAN_XIDFC_FLESA_Pos)) /* Assigment of value for FLESA in the CAN_XIDFC register */
#define CAN_XIDFC_LSE_Pos                     _UINT32_(16)                                         /* (CAN_XIDFC) List Size Extended Position */
#define CAN_XIDFC_LSE_Msk                     (_UINT32_(0x7F) << CAN_XIDFC_LSE_Pos)                /* (CAN_XIDFC) List Size Extended Mask */
#define CAN_XIDFC_LSE(value)                  (CAN_XIDFC_LSE_Msk & (_UINT32_(value) << CAN_XIDFC_LSE_Pos)) /* Assigment of value for LSE in the CAN_XIDFC register */
#define CAN_XIDFC_Msk                         _UINT32_(0x007FFFFF)                                 /* (CAN_XIDFC) Register Mask  */


/** \brief CAN register offsets definitions */
#define CAN_RXBE_0_REG_OFST            _UINT32_(0x00)      /* (CAN_RXBE_0) Rx Buffer and FIFO Element 0 Offset */
#define CAN_RXBE_1_REG_OFST            _UINT32_(0x04)      /* (CAN_RXBE_1) Rx Buffer and FIFO Element 1 Offset */
#define CAN_RXBE_DATA_REG_OFST         _UINT32_(0x08)      /* (CAN_RXBE_DATA) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA0_REG_OFST        _UINT32_(0x08)      /* (CAN_RXBE_DATA0) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA1_REG_OFST        _UINT32_(0x0C)      /* (CAN_RXBE_DATA1) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA2_REG_OFST        _UINT32_(0x10)      /* (CAN_RXBE_DATA2) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA3_REG_OFST        _UINT32_(0x14)      /* (CAN_RXBE_DATA3) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA4_REG_OFST        _UINT32_(0x18)      /* (CAN_RXBE_DATA4) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA5_REG_OFST        _UINT32_(0x1C)      /* (CAN_RXBE_DATA5) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA6_REG_OFST        _UINT32_(0x20)      /* (CAN_RXBE_DATA6) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA7_REG_OFST        _UINT32_(0x24)      /* (CAN_RXBE_DATA7) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA8_REG_OFST        _UINT32_(0x28)      /* (CAN_RXBE_DATA8) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA9_REG_OFST        _UINT32_(0x2C)      /* (CAN_RXBE_DATA9) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA10_REG_OFST       _UINT32_(0x30)      /* (CAN_RXBE_DATA10) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA11_REG_OFST       _UINT32_(0x34)      /* (CAN_RXBE_DATA11) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA12_REG_OFST       _UINT32_(0x38)      /* (CAN_RXBE_DATA12) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA13_REG_OFST       _UINT32_(0x3C)      /* (CAN_RXBE_DATA13) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA14_REG_OFST       _UINT32_(0x40)      /* (CAN_RXBE_DATA14) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXBE_DATA15_REG_OFST       _UINT32_(0x44)      /* (CAN_RXBE_DATA15) Rx Buffer and FIFO Element Data Offset */
#define CAN_RXF0E_0_REG_OFST           _UINT32_(0x00)      /* (CAN_RXF0E_0) Rx FIFO 0 Element 0 Offset */
#define CAN_RXF0E_1_REG_OFST           _UINT32_(0x04)      /* (CAN_RXF0E_1) Rx FIFO 0 Element 1 Offset */
#define CAN_RXF0E_DATA_REG_OFST        _UINT32_(0x08)      /* (CAN_RXF0E_DATA) Rx FIFO 0 Element Data Offset */
#define CAN_RXF1E_0_REG_OFST           _UINT32_(0x00)      /* (CAN_RXF1E_0) Rx FIFO 1 Element 0 Offset */
#define CAN_RXF1E_1_REG_OFST           _UINT32_(0x04)      /* (CAN_RXF1E_1) Rx FIFO 1 Element 1 Offset */
#define CAN_RXF1E_DATA_REG_OFST        _UINT32_(0x08)      /* (CAN_RXF1E_DATA) Rx FIFO 1 Element Data Offset */
#define CAN_SIDFE_0_REG_OFST           _UINT32_(0x00)      /* (CAN_SIDFE_0) Standard Message ID Filter Element Offset */
#define CAN_TXBE_0_REG_OFST            _UINT32_(0x00)      /* (CAN_TXBE_0) Tx Buffer Element 0 Offset */
#define CAN_TXBE_1_REG_OFST            _UINT32_(0x04)      /* (CAN_TXBE_1) Tx Buffer Element 1 Offset */
#define CAN_TXBE_DATA_REG_OFST         _UINT32_(0x08)      /* (CAN_TXBE_DATA) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA0_REG_OFST        _UINT32_(0x08)      /* (CAN_TXBE_DATA0) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA1_REG_OFST        _UINT32_(0x0C)      /* (CAN_TXBE_DATA1) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA2_REG_OFST        _UINT32_(0x10)      /* (CAN_TXBE_DATA2) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA3_REG_OFST        _UINT32_(0x14)      /* (CAN_TXBE_DATA3) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA4_REG_OFST        _UINT32_(0x18)      /* (CAN_TXBE_DATA4) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA5_REG_OFST        _UINT32_(0x1C)      /* (CAN_TXBE_DATA5) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA6_REG_OFST        _UINT32_(0x20)      /* (CAN_TXBE_DATA6) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA7_REG_OFST        _UINT32_(0x24)      /* (CAN_TXBE_DATA7) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA8_REG_OFST        _UINT32_(0x28)      /* (CAN_TXBE_DATA8) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA9_REG_OFST        _UINT32_(0x2C)      /* (CAN_TXBE_DATA9) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA10_REG_OFST       _UINT32_(0x30)      /* (CAN_TXBE_DATA10) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA11_REG_OFST       _UINT32_(0x34)      /* (CAN_TXBE_DATA11) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA12_REG_OFST       _UINT32_(0x38)      /* (CAN_TXBE_DATA12) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA13_REG_OFST       _UINT32_(0x3C)      /* (CAN_TXBE_DATA13) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA14_REG_OFST       _UINT32_(0x40)      /* (CAN_TXBE_DATA14) Tx Buffer Element Data Offset */
#define CAN_TXBE_DATA15_REG_OFST       _UINT32_(0x44)      /* (CAN_TXBE_DATA15) Tx Buffer Element Data Offset */
#define CAN_TXEFE_0_REG_OFST           _UINT32_(0x00)      /* (CAN_TXEFE_0) Tx Event FIFO Element 0 Offset */
#define CAN_TXEFE_1_REG_OFST           _UINT32_(0x04)      /* (CAN_TXEFE_1) Tx Event FIFO Element 1 Offset */
#define CAN_XIDFE_0_REG_OFST           _UINT32_(0x00)      /* (CAN_XIDFE_0) Extended Message ID Filter Element 0 Offset */
#define CAN_XIDFE_1_REG_OFST           _UINT32_(0x04)      /* (CAN_XIDFE_1) Extended Message ID Filter Element 1 Offset */
#define CAN_CCCR_REG_OFST              _UINT32_(0x18)      /* (CAN_CCCR) CC Control Offset */
#define CAN_CREL_REG_OFST              _UINT32_(0x00)      /* (CAN_CREL) Core Release Offset */
#define CAN_DBTP_REG_OFST              _UINT32_(0x0C)      /* (CAN_DBTP) Fast Bit Timing and Prescaler Offset */
#define CAN_ECR_REG_OFST               _UINT32_(0x40)      /* (CAN_ECR) Error Counter Offset */
#define CAN_ENDN_REG_OFST              _UINT32_(0x04)      /* (CAN_ENDN) Endian Offset */
#define CAN_ERROR_REG_OFST             _UINT32_(0x100)     /* (CAN_ERROR) Error Interrupt Flag Offset */
#define CAN_GFC_REG_OFST               _UINT32_(0x80)      /* (CAN_GFC) Global Filter Configuration Offset */
#define CAN_HPMS_REG_OFST              _UINT32_(0x94)      /* (CAN_HPMS) High Priority Message Status Offset */
#define CAN_IE_REG_OFST                _UINT32_(0x54)      /* (CAN_IE) Interrupt Enable Offset */
#define CAN_ILE_REG_OFST               _UINT32_(0x5C)      /* (CAN_ILE) Interrupt Line Enable Offset */
#define CAN_ILS_REG_OFST               _UINT32_(0x58)      /* (CAN_ILS) Interrupt Line Select Offset */
#define CAN_IR_REG_OFST                _UINT32_(0x50)      /* (CAN_IR) Interrupt Offset */
#define CAN_MRCFG_REG_OFST             _UINT32_(0x08)      /* (CAN_MRCFG) Message RAM Configuration Offset */
#define CAN_NBTP_REG_OFST              _UINT32_(0x1C)      /* (CAN_NBTP) Nominal Bit Timing and Prescaler Offset */
#define CAN_NDAT1_REG_OFST             _UINT32_(0x98)      /* (CAN_NDAT1) New Data 1 Offset */
#define CAN_NDAT2_REG_OFST             _UINT32_(0x9C)      /* (CAN_NDAT2) New Data 2 Offset */
#define CAN_PSR_REG_OFST               _UINT32_(0x44)      /* (CAN_PSR) Protocol Status Offset */
#define CAN_RWD_REG_OFST               _UINT32_(0x14)      /* (CAN_RWD) RAM Watchdog Offset */
#define CAN_RXBC_REG_OFST              _UINT32_(0xAC)      /* (CAN_RXBC) Rx Buffer Configuration Offset */
#define CAN_RXESC_REG_OFST             _UINT32_(0xBC)      /* (CAN_RXESC) Rx Buffer / FIFO Element Size Configuration Offset */
#define CAN_RXF0A_REG_OFST             _UINT32_(0xA8)      /* (CAN_RXF0A) Rx FIFO 0 Acknowledge Offset */
#define CAN_RXF0C_REG_OFST             _UINT32_(0xA0)      /* (CAN_RXF0C) Rx FIFO 0 Configuration Offset */
#define CAN_RXF0S_REG_OFST             _UINT32_(0xA4)      /* (CAN_RXF0S) Rx FIFO 0 Status Offset */
#define CAN_RXF1A_REG_OFST             _UINT32_(0xB8)      /* (CAN_RXF1A) Rx FIFO 1 Acknowledge Offset */
#define CAN_RXF1C_REG_OFST             _UINT32_(0xB0)      /* (CAN_RXF1C) Rx FIFO 1 Configuration Offset */
#define CAN_RXF1S_REG_OFST             _UINT32_(0xB4)      /* (CAN_RXF1S) Rx FIFO 1 Status Offset */
#define CAN_SIDFC_REG_OFST             _UINT32_(0x84)      /* (CAN_SIDFC) Standard ID Filter Configuration Offset */
#define CAN_TDCR_REG_OFST              _UINT32_(0x48)      /* (CAN_TDCR) Extended ID Filter Configuration Offset */
#define CAN_TEST_REG_OFST              _UINT32_(0x10)      /* (CAN_TEST) Test Offset */
#define CAN_TOCC_REG_OFST              _UINT32_(0x28)      /* (CAN_TOCC) Timeout Counter Configuration Offset */
#define CAN_TOCV_REG_OFST              _UINT32_(0x2C)      /* (CAN_TOCV) Timeout Counter Value Offset */
#define CAN_TSCC_REG_OFST              _UINT32_(0x20)      /* (CAN_TSCC) Timestamp Counter Configuration Offset */
#define CAN_TSCV_REG_OFST              _UINT32_(0x24)      /* (CAN_TSCV) Timestamp Counter Value Offset */
#define CAN_TXBAR_REG_OFST             _UINT32_(0xD0)      /* (CAN_TXBAR) Tx Buffer Add Request Offset */
#define CAN_TXBC_REG_OFST              _UINT32_(0xC0)      /* (CAN_TXBC) Tx Buffer Configuration Offset */
#define CAN_TXBCF_REG_OFST             _UINT32_(0xDC)      /* (CAN_TXBCF) Tx Buffer Cancellation Finished Offset */
#define CAN_TXBCIE_REG_OFST            _UINT32_(0xE4)      /* (CAN_TXBCIE) Tx Buffer Cancellation Finished Interrupt Enable Offset */
#define CAN_TXBCR_REG_OFST             _UINT32_(0xD4)      /* (CAN_TXBCR) Tx Buffer Cancellation Request Offset */
#define CAN_TXBRP_REG_OFST             _UINT32_(0xCC)      /* (CAN_TXBRP) Tx Buffer Request Pending Offset */
#define CAN_TXBTIE_REG_OFST            _UINT32_(0xE0)      /* (CAN_TXBTIE) Tx Buffer Transmission Interrupt Enable Offset */
#define CAN_TXBTO_REG_OFST             _UINT32_(0xD8)      /* (CAN_TXBTO) Tx Buffer Transmission Occurred Offset */
#define CAN_TXEFA_REG_OFST             _UINT32_(0xF8)      /* (CAN_TXEFA) Tx Event FIFO Acknowledge Offset */
#define CAN_TXEFC_REG_OFST             _UINT32_(0xF0)      /* (CAN_TXEFC) Tx Event FIFO Configuration Offset */
#define CAN_TXEFS_REG_OFST             _UINT32_(0xF4)      /* (CAN_TXEFS) Tx Event FIFO Status Offset */
#define CAN_TXESC_REG_OFST             _UINT32_(0xC8)      /* (CAN_TXESC) Tx Buffer Element Size Configuration Offset */
#define CAN_TXFQS_REG_OFST             _UINT32_(0xC4)      /* (CAN_TXFQS) Tx FIFO / Queue Status Offset */
#define CAN_XIDAM_REG_OFST             _UINT32_(0x90)      /* (CAN_XIDAM) Extended ID AND Mask Offset */
#define CAN_XIDFC_REG_OFST             _UINT32_(0x88)      /* (CAN_XIDFC) Extended ID Filter Configuration Offset */

